#ifndef  __LED_BEEP_H
#define  __LED_BEEP_H
#include "includes.h"

#define   BEEP_PORT		BEEP_GPIO_Port
#define 	BEEP_PIN		BEEP_Pin

#define BEEP_ON()				do{HAL_GPIO_WritePin(BEEP_PORT, BEEP_PIN, GPIO_PIN_SET);}while(0)
#define BEEP_OFF()			do{HAL_GPIO_WritePin(BEEP_PORT, BEEP_PIN, GPIO_PIN_RESET);}while(0)

/*==================================================================================
* 函 数 名： led_power_gpio_init
* 参    数： 
* 功能描述:  灯板，电源控制gpio初始化
* 返 回 值： None
* 备    注： None
* 作    者：  
* 创建时间： 2019-10-18 160210
==================================================================================*/
void led_power_gpio_init(void);
/*==================================================================================
* 函 数 名： open_t113_power
* 参    数： type == 1打开电源
* 功能描述:  打开主控T113电源
* 返 回 值： None
* 备    注： None
* 作    者：  
* 创建时间： 2019-10-18 160210
==================================================================================*/
void open_t113_power(uint8_t type);
/*==================================================================================
* 函 数 名： open_weigh_power
* 参    数： value =1 打开 value =0关闭
* 功能描述:  打开称重传感器控制电源
* 返 回 值： None
* 备    注： None
* 作    者：  
* 创建时间： 2019-10-18 160222
==================================================================================*/
void open_weigh_power(uint8_t value);
/*==================================================================================
* 函 数 名： control_led_board_power
* 参    数： value
* 功能描述:  控制led灯板电源
* 返 回 值： None
* 备    注： None
* 作    者：  
* 创建时间： 2019-10-18 160222
==================================================================================*/
void control_led_board_power(uint8_t value);
/*==================================================================================
* 函 数 名： set_run_led_state
* 参    数： None
* 功能描述:  设置运行led灯状态
* 返 回 值： None
* 备    注： None
* 作    者：  
* 创建时间： 2019-09-18 120135
==================================================================================*/
void set_run_led_state(uint8_t type);
/*==================================================================================
* 函 数 名： set_run_led_toggle
* 参    数： None
* 功能描述:  设置led灯交替闪烁
* 返 回 值： None
* 备    注： None
* 作    者：  
* 创建时间： 2019-09-18 120135
==================================================================================*/
void set_run_led_toggle(void);

#endif
